//++Кузнецов  для нашего реквизита проект
&НаСервере
&После("ПриСозданииНаСервере")
Процедура аск_сод_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АСК_ДобавлениеРеквизитов(); 	
КонецПроцедуры

&НаСервере
Процедура АСК_ДобавлениеРеквизитов() //Моя процедура 
    
    Добавляемые = Новый Массив;

    НовыйРеквизит = Новый РеквизитФормы(
        "Проект",
        Новый ОписаниеТипов("СправочникСсылка.Проекты")  // уточните тип
    );
    НовыйРеквизит.Заголовок = "Проект";
    Добавляемые.Добавить(НовыйРеквизит);

    ЭтаФорма.ИзменитьРеквизиты(Добавляемые);

    ЭлементПроект = ЭтаФорма.Элементы.Вставить(
        "Проект",
        Тип("ПолеФормы"),
        Неопределено,                              // Родитель — корень формы
        ЭтаФорма.Элементы.Содержание     // Вставить ПЕРЕД этим элементом
    );

    ЭлементПроект.Вид         = ВидПоляФормы.ПолеВвода;
    ЭлементПроект.ПутьКДанным = "Проект";  // Ссылка на программный реквизит формы
    ЭлементПроект.Заголовок   = "Проект";
	Если Параметры.свойство("проект") тогда
		ЭлементПроект.ОтметкаНезаполненного = не ЗначениеЗаполнено(Параметры.проект);
	Иначе
		ЭлементПроект.ОтметкаНезаполненного = Истина;
	КонецЕсли;
	ЭлементПроект.УстановитьДействие("ПриИзменении", "ПроектПриИзменении");
	
	Если Параметры.Свойство("Проект") тогда
		ЭтаФорма.Проект = Параметры.Проект; //Заполнение
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ЗакрытьСИзменениями")
Процедура аск_сод_ЗакрытьСИзменениями()

	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;

	Если ВремяПлан = 0 Тогда 
		Начало = '00010101';
		Окончание = '00010101';
	КонецЕсли;	

	Результат = Новый Структура;
	Результат.Вставить("НомерПункта");
	Результат.Вставить("Исполнитель");
	Результат.Вставить("Содержание");
	Результат.Вставить("ТребуетПринятияРешения");
	Результат.Вставить("Начало");
	Результат.Вставить("Окончание");
	Результат.Вставить("ВремяПлан");
	Результат.Вставить("ВремяФакт");
	Результат.Вставить("Комментарий");
    #Вставка
	//++Кузнецов
	Результат.Вставить("Проект");
	Если не  ЗначениеЗаполнено(ЭтотОбъект.Проект)  тогда 
		ОчиститьСообщения();
		Сообщить("Заполните проект!");
		Возврат;
	КонецЕсли;
	#КонецВставки    
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);

	Модифицированность = Ложь;
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении()
	Элементы.Проект.ОтметкаНезаполненного = не ЗначениеЗаполнено(ЭтотОбъект.проект);
КонецПроцедуры  

//--Кузнецов  для нашего реквизита проект
