
&ИзменениеИКонтроль("СоздатьПроцессИсполненияПоПунктуДействия")
Функция аск_сод_СоздатьПроцессИсполненияПоПунктуДействия(Действие, ИдентификаторПункта, ПроцессОбработки)

	Отбор = Новый Структура;
	Отбор.Вставить("ФункцияУчастника",
	Перечисления.ФункцииУчастниковИсполнения.Исполнитель);
	Отбор.Вставить("ИдентификаторПункта", ИдентификаторПункта);

	Если Действие.Участники.НайтиСтроки(Отбор).Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Строка = Действие.Пункты.Найти(ИдентификаторПункта, "Идентификатор");
	ОписаниеПункта = ""; НомерПункта = "";
	Если Строка <> Неопределено Тогда
		ОписаниеПункта = Строка.Описание;
		НомерПункта = Строка.Номер;
	КонецЕсли;

	ВедущаяЗадача = Неопределено;
	Если ПроцессОбработки <> Неопределено Тогда
		ШаблонНаименования = НСтр("ru = 'Обработка действия по пункту ""%1""'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		НаименованиеЗадачи = СтрШаблон(ШаблонНаименования, НомерПункта);
		ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.СоздатьЗадачуОбработкиЭлементаСхемы(
		НаименованиеЗадачи, ПроцессОбработки);
	КонецЕсли;

	ПроцессОбъект = БизнесПроцессы.Исполнение.СоздатьБизнесПроцесс();
	СтруктураДляЗаполнения = ПроцессОбъект.СтруктураДанныхДляЗаполнения();

	ДопустимыеУчастники = ДопустимыеИсполнителиДействияИсполнения(Действие, ПроцессОбъект, ИдентификаторПункта);
	
	#Вставка
	//++Кузнецов при заполнении проекта из таб части протокола нужно для определения строки, из которой будем заполнять проект
	СтруктураДляЗаполнения.вставить("НомерПункта",НомерПункта);
	#КонецВставки
	
	ЗаполнитьСтруктуруДляПроцессаИсполнения(
	СтруктураДляЗаполнения, Действие, ДопустимыеУчастники, ВедущаяЗадача, ИдентификаторПункта);	

	ПроцессОбъект.Заполнить(СтруктураДляЗаполнения);

	Возврат ПроцессОбъект;

КонецФункции
