
&ИзменениеИКонтроль("ПриИзмененииНомераПунктаПрограммы")
Процедура аск_сод_ПриИзмененииНомераПунктаПрограммы()

	// Помеченные на удаление пункты протокола не отражаем в протоколе мероприятия.
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Мероприятие = Владелец.ПолучитьОбъект();
	Мероприятие.Заблокировать();

	// Находим строку в протоколе мероприятия. Если ее нет - добавляем.
	СтрокаЭтогоПунктаПротокола = Мероприятие.Протокол.Найти(Ссылка, "ПунктПротокола");
	Если СтрокаЭтогоПунктаПротокола = Неопределено Тогда

		ОписаниеЧисла = Новый ОписаниеТипов("Число");

		РазделенныйНомерПункта = СтрРазделить(НомерПунктаПротокола, ".");
		Если РазделенныйНомерПункта.Количество() >= 1 Тогда
			АвтоНомерПункта = ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[0]);
		Иначе
			АвтоНомерПункта = 0;
		КонецЕсли;
		Если РазделенныйНомерПункта.Количество() >= 2 Тогда
			АвтоНомерПодпункта = ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[1]);
		Иначе
			АвтоНомерПодпункта = 0;
		КонецЕсли;

		Если АвтоНомерПункта = 0 Тогда

			ИндексВставки = Мероприятие.Протокол.Количество();

		Иначе

			ПунктыПротокола = Мероприятие.Протокол.ВыгрузитьКолонку("ПунктПротокола");
			РеквизитыПунктовПротокола =
			ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			ПунктыПротокола,
			"НомерПунктаПротокола");

			ИндексВставки = 0;
			Для Каждого СтрокаПротокола Из Мероприятие.Протокол Цикл

				РеквизитыПунктаПротокола =
				РеквизитыПунктовПротокола[СтрокаПротокола.ПунктПротокола];

				РазделенныйНомерПункта =
				СтрРазделить(РеквизитыПунктаПротокола.НомерПунктаПротокола, ".");
				Если РазделенныйНомерПункта.Количество() >= 1 Тогда
					НомерПунктаСтроки = ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[0]);
				Иначе
					НомерПунктаСтроки = 0;
				КонецЕсли;
				Если РазделенныйНомерПункта.Количество() >= 2 Тогда
					НомерПодпунктаСтроки =
					ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[1]);
				Иначе
					НомерПодпунктаСтроки = 0;
				КонецЕсли;

				Если НомерПунктаСтроки = 0 Тогда
					ИндексВставки = Мероприятие.Протокол.Количество();
					Прервать;
				КонецЕсли;

				Если АвтоНомерПункта > НомерПунктаСтроки Тогда

					// Наш пункт ещё впереди.
					ИндексВставки = ИндексВставки + 1;
					Продолжить;

				ИначеЕсли АвтоНомерПункта = НомерПунктаСтроки
					И АвтоНомерПодпункта >= НомерПодпунктаСтроки Тогда

					// Это наш пункт, наш подпункт ещё впередит.
					ИндексВставки = ИндексВставки + 1;
					Продолжить;

				Иначе

					// Наш пункт уже прошёл.
					Прервать;

				КонецЕсли;

				ИндексВставки = ИндексВставки + 1;

			КонецЦикла;

		КонецЕсли;

		СтрокаЭтогоПунктаПротокола = Мероприятие.Протокол.Вставить(ИндексВставки);


	КонецЕсли;
	СтрокаЭтогоПунктаПротокола.НомерПунктаПрограммы = НомерПунктаПрограммы;
	СтрокаЭтогоПунктаПротокола.ПунктПротокола = Ссылка;
	#Вставка 
	//++Кузнецов при добавлении в ТЧ протокол строки командой добавить -  заполняем  проект, ибо без кнопки записать он не заполняется в Объекте. 
	//При каждом добавлении протокола мероприятие записывается, тут идет заполнение номера строки и самого протокола, а вот проект не заполнялся
	СтрокаЭтогоПунктаПротокола.Проект = Ссылка.Проект; 
	//--Кузнецов
	#КонецВставки

	Мероприятие.Записать();

КонецПроцедуры
