Функция ПолучитьПроект_ПоФинансовомуШифру(Параметры) Экспорт
	
	Для Каждого СтрДвижения ИЗ Параметры.Источник.ДвиженияОперации Цикл
		ФинШифр_XDTO = СтрДвижения.Проект;
		
		Если ТипЗнч(ФинШифр_XDTO) <> тип("ОбъектXDTO") Тогда 
			Продолжить; // система при тестировании кода сюда передаёт Неопределено 
		КонецЕсли;
		
		ФинШифр_Наименование = ФинШифр_XDTO.name;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	аск_сод_ФинансовыеШифры.Ссылка КАК ФинансовыйШифр
			|ИЗ
			|	Справочник.аск_сод_ФинансовыеШифры КАК аск_сод_ФинансовыеШифры
			|ГДЕ
			|	аск_сод_ФинансовыеШифры.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", СокрЛП(ФинШифр_Наименование));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Параметры.Результат = Выборка.ФинансовыйШифр.Проект;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Параметры.Результат;
КонецФункции