//++Кузнецов Сделал заполнение проектов из таблчиной части протоколы у мероприятия.
//Единственное что смог найти для определения нужной строки протоколов это пункт протокла в впредыдущей фкнкции. 
//Там добавил в струтктуру данных НомерПунктаПротокола
&После("ОбработкаЗаполнения")
Процедура аск_сод_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 
	Если ДанныеЗаполнения.свойство("Предметы") тогда
		Если ТипЗнч(ДанныеЗаполнения.Предметы) = ТИП("СправочникСсылка.Мероприятия") тогда	
			Для каждого стрПроткола из ДанныеЗаполнения.Предметы.Протокол цикл 
				Если стрПроткола.ПунктПротокола.НомерПунктаПротокола = ДанныеЗаполнения.НомерПункта тогда
					ЭтотОбъект.проект = стрПроткола.ПунктПротокола.Проект;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//--Кузнецов