
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ТабличныйДокумент) Тогда
		ЭтаФорма.ТабДок = ЗначениеИзСтрокиВнутр(Объект.ТабличныйДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПовторитьЗагрузку(Команда)

	ЗначениеНастройки = Новый Структура;
	ЗначениеНастройки.Вставить("КаталогПроекта", Объект.КаталогПроекта);
	ЗначениеНастройки.Вставить("КаталогНачалаЗагрузки", Объект.КаталогНачалаЗагрузки);
	ЗначениеНастройки.Вставить("Проект", Объект.Проект);
	ЗначениеНастройки.Вставить("Организация", Объект.Организация);
	ЗначениеНастройки.Вставить("Контрагент", Объект.Контрагент);
	ЗначениеНастройки.Вставить("РазделительЗагрузки", Объект.РазделительЗагрузки);
	ЗначениеНастройки.Вставить("тзФинансовыеШифры", ПолучитьФинансовыеШифрыНаСервере());
	
	ПараметрыФормы = Новый Структура("ПараметрыОткрытия", ЗначениеНастройки);
	ОткрытьФорму("Обработка.ЗагрузитьДокументыСОД.Форма", ПараметрыФормы, ЭтаФорма, , , );

КонецПроцедуры

&НаСервере
Функция ПолучитьФинансовыеШифрыНаСервере()
	Возврат ЗначениеВСтрокуВнутр(Объект.ФинансовыеШифры.Выгрузить());
КонецФункции

