//++Кузнецов для заполнения проекта (наш реквизит)
&ИзменениеИКонтроль("ЗаполнитьПротокол")
Процедура аск_сод_ЗаполнитьПротокол(Мероприятие)

	НачатьТранзакцию();
	Попытка

		// Очистка протокола.
		МероприятиеОбъект = Мероприятие.ПолучитьОбъект();
		МероприятиеОбъект.Заблокировать();
		МероприятиеОбъект.Протокол.Очистить();
		МероприятиеОбъект.Записать();
		МероприятиеОбъект.Разблокировать();

		// Заполнение протокола.
		ДанныеЗаполнения = Новый Структура("Владелец", Мероприятие);
		Для Каждого Строка Из МероприятиеОбъект.Программа Цикл

			Если Не Строка.ТребуетПринятияРешения Тогда 
				Продолжить;
			КонецЕсли;

			ПунктПротоколаОбъект = Справочники.ПротоколыМероприятий.СоздатьЭлемент();
			
			ПунктПротоколаОбъект.Заполнить(ДанныеЗаполнения);
			ПунктПротоколаОбъект.НомерПунктаПрограммы = Строка.НомерПункта;
			ПунктПротоколаОбъект.НомерПунктаПротокола = Строка.НомерПункта;
			ПунктПротоколаОбъект.Слушали = УправлениеМероприятиямиКлиентСервер.СформироватьТекстСлушали(Строка);
			
			#Вставка 
			//++Кузнецов Заполняем наш реквизит Проект
			ПунктПротоколаОбъект.Проект = Строка.Проект;
			#КонецВставки 
			
			ПунктПротоколаОбъект.Записать();

		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&ИзменениеИКонтроль("ВывестиПротоколМероприятия")
Процедура аск_сод_ВывестиПротоколМероприятия(Протокол)

	ПунктыПротокола = Протокол.Выгрузить(, "ПунктПротокола").ВыгрузитьКолонку("ПунктПротокола");

	// Чтение данных протокола.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПротоколыМероприятий.Ссылка,
	|	ПротоколыМероприятий.Выступили,
	|	ПротоколыМероприятий.Ответственный,
	|	ПротоколыМероприятий.Решили,
	|	ПротоколыМероприятий.Слушали,
	|	ПротоколыМероприятий.СрокИсполненияПроцесса КАК СрокИсполнения,
	|	ПротоколыМероприятий.СостояниеИсполнения,
	|	ПротоколыМероприятий.Исполнение,
	|	ПротоколыМероприятий.НомерПунктаПротокола,
	|	ПротоколыМероприятий.Исполнители.(
	|		Исполнитель)
	|ИЗ
	|	Справочник.ПротоколыМероприятий КАК ПротоколыМероприятий
	|ГДЕ
	|	ПротоколыМероприятий.Ссылка В (&ПунктыПротокола)";

	Запрос.УстановитьПараметр("ПунктыПротокола", ПунктыПротокола);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ПараметрыОтбора = Новый Структура("ПунктПротокола", Выборка.Ссылка);
		СтрокиПунктаПротокола = Протокол.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиПунктаПротокола.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаПунктаПротокола = СтрокиПунктаПротокола[0];
		ЗаполнитьЗначенияСвойств(СтрокаПунктаПротокола, Выборка, , "Исполнители");

		СтрокаПунктаПротокола.Исполнители.Очистить();
		ВыборкаИсполнители = Выборка.Исполнители.Выбрать();
		Пока ВыборкаИсполнители.Следующий() Цикл
			НоваяСтрокаИсполнитель = СтрокаПунктаПротокола.Исполнители.Добавить();
			НоваяСтрокаИсполнитель.Исполнитель = ВыборкаИсполнители.Исполнитель;
		КонецЦикла;

		МассивИсполнители =
		СтрокаПунктаПротокола.Исполнители.Выгрузить().ВыгрузитьКолонку("Исполнитель");
		СтрокаПунктаПротокола.ПредставлениеИсполнителей = СтрСоединить(МассивИсполнители, ", "); 
		
		#Вставка
		//++Кузнецов Заполняем наш реквизит Проект
		СтрокаПунктаПротокола.Проект = Выборка.ссылка.Проект;
		#КонецВставки
	КонецЦикла;

	// Расчет номеров пунктов протокола мероприятия.
	УправлениеМероприятиямиКлиентСервер.ВывестиНомераПунктовПротокола(Протокол);

КонецПроцедуры
//--Кузнецов для заполнения проекта (наш реквизит)
