//++Кузнецов  для нашего реквизита проект
&НаСервере
Процедура АСК_ДобавлениеРеквизитов()
			
	ЭлементПроект = ЭтаФорма.Элементы.Вставить(
	"Проект",
	Тип("ПолеФормы"),
	Неопределено,                                // родитель = корень формы
	ЭтаФорма.Элементы.НомерПунктаПротокола       // вставить ПЕРЕД этим элементом
	);
	ЭлементПроект.Вид               = ВидПоляФормы.ПолеВвода;
	ЭлементПроект.ПутьКДанным       = "Объект.Проект";
	ЭлементПроект.Заголовок         = "Проект";
	ЭлементПроект.ТолькоПросмотр    = Истина;  
	//ЭлементПроект.АвтоОтметкаНезаполненного = Ложь;
	ЭлементПроект.ОтметкаНезаполненного = не ЗначениеЗаполнено(Объект.проект);
	ЭлементПроект.УстановитьДействие("ПриИзменении", "ПроектПриИзменении");
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура аск_сод_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АСК_ДобавлениеРеквизитов(); 
	ЗаполнитьПроект(Объект.Владелец)
КонецПроцедуры

&НаКлиенте
Процедура аск_сод_ПриОткрытииПосле(Отказ)
	ДоступностьПроекта();
КонецПроцедуры

&НаКлиенте
&После("НомерПунктаПрограммыПриИзменении")
Процедура аск_сод_НомерПунктаПрограммыПриИзменении(Элемент) 
	Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	ЗаполнитьПроект(Объект.Владелец);	 
	ДоступностьПроекта(); 	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПроект(Мероприятие)
	
	Если ТипЗнч(Мероприятие) = Тип("СправочникСсылка.Мероприятия") тогда
		
		НайденнаяСтрока = Мероприятие.Программа.Найти(Объект.НомерПунктаПрограммы, "НомерПункта");
		
		Если НайденнаяСтрока <> Неопределено Тогда
			Объект.Проект = НайденнаяСтрока.Проект;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПроекта()
	 	//++Кузнецов выбираем только если пункт не выбран.
	Если ЗначениеЗаполнено(Объект.НомерПунктаПрограммы) тогда 
		Элементы.Проект.ТолькоПросмотр    = Истина;	
	Иначе 
		Элементы.Проект.ТолькоПросмотр    = Ложь;
	КОнецЕсли;  
	
	//Элементы.Проект.АвтоОтметкаНезаполненного = Ложь;
	Элементы.Проект.ОтметкаНезаполненного = не ЗначениеЗаполнено(Объект.проект);

КонецПроцедуры


&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура аск_сод_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если не  ЗначениеЗаполнено(ТекущийОбъект.Проект)  тогда
		Сообщить("Заполните проект!");
		Отказ = ИСТИНА;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПроектПриИзменении()
	Элементы.Проект.ОтметкаНезаполненного = не ЗначениеЗаполнено(Объект.проект);
КонецПроцедуры  
//--Кузнецов  для нашего реквизита проект