#Область ФормированиеHTMLПредставленияДокумента
//++Кузнецов А.А. 25.09.2026 
//Пока что закомментировал захваченную функцию. Решили пока не менять формирование представления из за мелочей. Оставил на будущее, чтобы не искать заново.
//Она определяет что документ из группы "СОД" и вместо типового формирования HTML я подставил свои (скопировал типовые и изменил как того хотел заказчик)
//Остальные функции области работают и ждут включения текущей
//&ИзменениеИКонтроль("ПолучитьОбзорДокумента")
//Функция аск_сод_ПолучитьОбзорДокумента(Форма)
//	HTMLТекст = ОбзорДокументаПереопределяемый.ПолучитьОбзорДокумента(Форма);
//	Если ЗначениеЗаполнено(HTMLТекст) Тогда 
//		Возврат HTMLТекст;
//	КонецЕсли;
//	
//	Объект = Форма.Объект;
//	
//	КэшДокументыПредприятияФормаЭлемента =
//	КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
//	КэшОбзораДокумента = КэшиНаВремяВызова.КэшОбзораДокумента();
//	Если КэшДокументыПредприятияФормаЭлемента.Инициализирован
//		И КэшДокументыПредприятияФормаЭлемента.КэшДокумента.Ссылка = Объект.Ссылка Тогда
//		ЭтоВходящийДокумент = ЗначениеЗаполнено(КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента)
//		И КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента.ЯвляетсяВходящейКорреспонденцией;
//		ЭтоИсходящийДокумент = ЗначениеЗаполнено(КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента)
//		И КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента.ЯвляетсяИсходящейКорреспонденцией;
//	ИначеЕсли КэшОбзораДокумента.Заполнен И КэшОбзораДокумента.Документ = Объект.Ссылка Тогда
//		ЭтоВходящийДокумент = КэшОбзораДокумента.КэшВидаДокумента.ЯвляетсяВходящейКорреспонденцией;
//		ЭтоИсходящийДокумент = КэшОбзораДокумента.КэшВидаДокумента.ЯвляетсяИсходящейКорреспонденцией;
//	Иначе
//		ЭтоВходящийДокумент = ДелопроизводствоКлиентСервер.ЭтоВходящийДокумент(Объект.Ссылка);
//		ЭтоИсходящийДокумент = ДелопроизводствоКлиентСервер.ЭтоИсходящийДокумент(Объект.Ссылка);
//	КонецЕсли;
//	
//	Если ЭтоВходящийДокумент Тогда
//		Возврат ПолучитьОбзорВходящегоДокумента(Форма);
//	ИначеЕсли ЭтоИсходящийДокумент Тогда
//		Возврат ПолучитьОбзорИсходящегоДокумента(Форма);
//		
//	Иначе	
//		ПараметрыУчета = Новый Структура;
//		ПараметрыУчета.Вставить("ВестиУчетСторон", Ложь);
//		ПараметрыУчета.Вставить("ВестиУчетПоКонтрагентам", Ложь);
//		
//		Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
//			КэшДокументыПредприятияФормаЭлемента =
//			КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
//			Если КэшДокументыПредприятияФормаЭлемента.Инициализирован
//				И КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента = Объект.ВидДокумента Тогда
//				ПараметрыУчета = КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента;
//			Иначе
//				ПараметрыУчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
//				Объект.ВидДокумента,
//				"ВестиУчетСторон, ВестиУчетПоКонтрагентам");
//			КонецЕсли;
//		КонецЕсли;
//		#Вставка 
//		//++Кузнецов
//		//Для документов ИЗ ГРУППЫ СОД меняем порядок и убираем лишнее 
//		Если ТипЗнч(Форма)  = Тип("ФормаКлиентскогоПриложения") Тогда  
//			ВидДока = Форма.ВидДокументаПриОткрытии;
//		ИначеЕсли ТипЗнч(Форма) = Тип("структура") тогда 
//			ВидДока = Форма.ВидДокументаКэш.Ссылка;
//		КонецЕсли;  
//		
//		СОД = аск_сод_Сервер.АСК_ПроверяемНаПринадлежностьСОД(ВидДока);
//		
//		Если сод тогда //Доработанное решение
//			Если ПараметрыУчета.ВестиУчетСторон Или ПараметрыУчета.ВестиУчетПоКонтрагентам Тогда
//				Возврат аск_ФормироватьHTMLСКонтрагентом(Форма);
//			Иначе
//				Возврат аск_ФормироватьHTMLБезКонтрагента(Форма);
//			КонецЕсли; 		
//		Иначе //Типовое выполнение
//		#КонецВставки
//			Если ПараметрыУчета.ВестиУчетСторон Или ПараметрыУчета.ВестиУчетПоКонтрагентам Тогда
//				Возврат ПолучитьОбзорДокументаСКонтрагентом(Форма);
//			Иначе
//				Возврат ПолучитьОбзорДокументаБезКонтрагента(Форма);
//			КонецЕсли; 
//		#Вставка  
//			//--Кузнецов
//		КонецЕсли;
//		#КонецВставки
//	КонецЕсли;
//	
//КонецФункции   

Функция Проверка(ОписаниеРеквизита,МестоВызова) 
	
	Если МестоВызова = "Первичка" тогда
		Если ОписаниеРеквизита.Наименование <> "ЗагруженАвтоматически" ТОгда 
			Возврат Истина; 
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	ИначеЕсли МестоВызова = "ЗагруженАвтоматически" Тогда
		Если ОписаниеРеквизита.Наименование = "ЗагруженАвтоматически"  тогда
			Возврат Истина; 
		Иначе
			Возврат Ложь;
		КонецЕсли;     
	КонецЕсли; 
КонецФункции

Процедура АСК_ДобавитьДополнительныеРеквизиты(HTMLТекст, Объект, Форма, МестоВызова)
	
	Если Форма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Свойства_ИспользоватьСвойства Тогда
		
		ОписаниеЗависимыхДополнительныхРеквизитов = Форма.Свойства_ОписаниеЗависимыхДополнительныхРеквизитов;
		СтруктураОтбора = Новый Структура("ИмяРеквизитаЗначение");
		ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
		
		Для Каждого ОписаниеРеквизита Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл  
			//++Кузнецов
			Если Проверка(ОписаниеРеквизита,МестоВызова) Тогда //Исключаем все что нужно  		 
				
				Видимость = Истина;
				Если ОписаниеЗависимыхДополнительныхРеквизитов <> Неопределено Тогда
					СтруктураОтбора.ИмяРеквизитаЗначение = ОписаниеРеквизита.ИмяРеквизитаЗначение;
					ОписаниеЗависимогоРеквизита = ОписаниеЗависимыхДополнительныхРеквизитов.НайтиСтроки(СтруктураОтбора);
					Если ОписаниеЗависимогоРеквизита.Количество()
						И ОписаниеЗависимогоРеквизита[0].УсловиеВидимости <> Неопределено Тогда
						Попытка
							Видимость = УправлениеСвойствами.РезультатВычисленияУсловияДокументооборот(
							Форма,
							Объект,
							ОписаниеЗависимогоРеквизита[0].УсловиеВидимости);
						Исключение
							ЗаписьЖурналаРегистрации(
							ОбзорОбъектов.СобытиеЖурналаРегистрации(),
							УровеньЖурналаРегистрации.Ошибка,,,
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							Видимость = Ложь;
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
				
				Если Форма[ОписаниеРеквизита.ИмяРеквизитаЗначение] = Неопределено
					И ОписаниеРеквизита.Свойство.ТипЗначения = ОписаниеТипаБулево Тогда
					Значение = Ложь;
				Иначе
					Значение = Форма[ОписаниеРеквизита.ИмяРеквизитаЗначение];
				КонецЕсли;
				
				Если Не ОписаниеРеквизита.Удалено И Видимость И ЗначениеЗаполнено(Значение) Тогда
					ДобавитьДопРеквизит(HTMLТекст, Значение, ОписаниеРеквизита);
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция аск_ФормироватьHTMLСКонтрагентом (Форма)
	Объект = Форма.Объект;
	Организация = Объект.Организация;
	Шаблон = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(Объект.Ссылка,
		"Шаблон");
	ДатаНачалаОтсчета = Делопроизводство.ДатаУчетаДокумента(Объект);
	
	Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда 
		КэшДокументыПредприятияФормаЭлемента =
			КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
		Если КэшДокументыПредприятияФормаЭлемента.Инициализирован
			И КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента = Объект.ВидДокумента Тогда
			РеквизитыВида = КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента;
		Иначе
			РеквизитыВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидДокумента,
				"УчитыватьСуммуДокумента, ИспользоватьСрокИсполнения, ВестиУчетПоНоменклатуреДел, УчитыватьСрокДействия,
				|УчитыватьНедействующиеДокументы, ВестиУчетТоваровИУслуг, ВестиУчетПоСтатьямДДС, ВестиУчетПоОрганизациям,
				|ВестиУчетСторон, ВестиУчетПоКонтрагентам, ЯвляетсяЗаявкойНаОплату,
				|УчитыватьМестоХранения, УчитыватьОтветственногоЗаХранение, КонтролироватьНаличиеОригинала,
				|ВестиУчетПоТематикам, СрокИсполненияУказанВРабочихДнях, ИспользоватьВременныеНомера");
		КонецЕсли;
	Иначе 
		РеквизитыВида = Новый Структура;
		РеквизитыВида.Вставить("УчитыватьСуммуДокумента", Ложь);
		РеквизитыВида.Вставить("ВестиУчетТоваровИУслуг", Ложь);
		РеквизитыВида.Вставить("ИспользоватьСрокИсполнения", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоНоменклатуреДел", Ложь);
		РеквизитыВида.Вставить("УчитыватьСрокДействия", Ложь);
		РеквизитыВида.Вставить("УчитыватьНедействующиеДокументы", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоСтатьямДДС", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоОрганизациям", Ложь);
		РеквизитыВида.Вставить("ВестиУчетСторон", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоКонтрагентам", Ложь);
		РеквизитыВида.Вставить("ЯвляетсяЗаявкойНаОплату", Ложь);
		РеквизитыВида.Вставить("УчитыватьМестоХранения", Ложь);
		РеквизитыВида.Вставить("УчитыватьОтветственногоЗаХранение", Ложь);
		РеквизитыВида.Вставить("КонтролироватьНаличиеОригинала", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоТематикам", Ложь);
		РеквизитыВида.Вставить("СрокИсполненияУказанВРабочихДнях", Ложь);
		РеквизитыВида.Вставить("ИспользоватьВременныеНомера", Ложь);
	КонецЕсли;
	
	// Формируем основное представление документа	
	HTMLТекст = "<html>
	|<head>
	|<style type=""text/css"">
	|	body {
	|		overflow:    auto;
	|		margin-top:  6px;
	|		margin-left: 10px;
	|		margin-bottom: 0px;
	|		font-family: Arial, sans-serif;
	|		font-size:   10pt;}
	|	table {
	|		width:       100%; 
	|		font-family: Arial, sans-serif;
	|		font-size:   10pt;}
	|	td {vertical-align: top;}
	| 	a:link {
	|		color: #006699; text-decoration: none;}
	|	a:visited {
	|		color: #006699; text-decoration: none;}
	|	a:hover {
	|		color: #006699; text-decoration: underline;}
	|	p {
	|		margin-top: 7px;}
	|</style>
	|<body>";
	
	HTMLТекст = HTMLТекст + "<table>";
	
	Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
		
		Если РеквизитыВида.ВестиУчетПоТематикам И ЗначениеЗаполнено(Объект.Тематика) Тогда 
			HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A> - <A href=v8doc:%3>%4</A>" + " " + НСтр("ru = '№'") + "%5%6",
				ПолучитьНавигационнуюСсылку(Объект.ВидДокумента),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ВРег((Строка(Объект.ВидДокумента)))),
				ПолучитьНавигационнуюСсылку(Объект.Тематика),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ВРег((Строка(Объект.Тематика)))),
				?(ЗначениеЗаполнено(Объект.РегистрационныйНомер), Объект.РегистрационныйНомер,
					?(РеквизитыВида.ИспользоватьВременныеНомера И ЗначениеЗаполнено(Объект.ВременныйНомер),
						Объект.ВременныйНомер, "_____")),
				?(ЗначениеЗаполнено(Объект.ДатаРегистрации), НСтр("ru =' от '") + Формат(Объект.ДатаРегистрации, "ДЛФ=D"), ""));
		Иначе
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A>" + НСтр("ru = ' № '") + "%3%4",
				ПолучитьНавигационнуюСсылку(Объект.ВидДокумента),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ВРег((Строка(Объект.ВидДокумента)))),
				?(ЗначениеЗаполнено(Объект.РегистрационныйНомер), Объект.РегистрационныйНомер,
					?(РеквизитыВида.ИспользоватьВременныеНомера И ЗначениеЗаполнено(Объект.ВременныйНомер),
						Объект.ВременныйНомер, "_____")),
				?(ЗначениеЗаполнено(Объект.ДатаРегистрации), НСтр("ru =' от '") + Формат(Объект.ДатаРегистрации, "ДЛФ=D"), ""));
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td></tr>";
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"" >";
	
	HTMLТекст = HTMLТекст + "<p>";
	Заголовок = Объект.Заголовок;
	HTMLТекст = HTMLТекст + СтрШаблон(
		"<B>%1</B>",
		РаботаС_HTML.ЗаменитьСпецСимволыHTML(Заголовок));
	HTMLТекст = HTMLТекст + "</td></tr>";	
		
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"" >";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если ЗначениеЗаполнено(Объект.Содержание) Тогда
		Содержание = Объект.Содержание;
		HTMLТекст = HTMLТекст + СтрЗаменить(РаботаС_HTML.ЗаменитьСпецСимволыHTML(Содержание), Символы.ПС, "<br>");
		HTMLТекст = HTMLТекст + "<p>";
	КонецЕсли;
	
	//++Кузнецов перенес
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьСвязиОбъектов") Тогда
	//	
	//	КраткиеСведенияОСвязях = СвязиОбъектов.КраткиеСведенияОСвязях(Объект.Ссылка);
	//		
	//	Если Не ЗначениеЗаполнено(КраткиеСведенияОСвязях) Тогда	
	//		КраткиеСведенияОСвязях = НСтр("ru = 'Связи: не заданы'");
	//	КонецЕсли;	
	//		
	//	HTMLТекст = HTMLТекст + СтрШаблон(
	//		"<b><A href=v8doc:tasks/ShowLinks/%1>%2</A></b> <br>",
	//		ПолучитьНавигационнуюСсылку(Объект.Ссылка),
	//		РаботаС_HTML.ЗаменитьСпецСимволыHTML(КраткиеСведенияОСвязях));
	//КонецЕсли;	
	//--Кузнецов
	
	ДобавитьНадписьОСроке(HTMLТекст, Объект, РеквизитыВида, ДатаНачалаОтсчета, НСтр("ru = 'Срок исполнения:'"));
	
	// Сумма и статьи ДДС.
	Если РеквизитыВида.УчитыватьСуммуДокумента Тогда
		Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Наименование");
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Сумма:'"), Формат(Объект.Сумма, "ЧДЦ=2; ЧН=0") + " " + 
			Валюта);
		
		Если Форма.УчитыватьНДС Тогда 
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Сумма НДС:'"), Формат(Объект.СуммаНДС, "ЧДЦ=2; ЧН=0") + " " + 
				Валюта);
		КонецЕсли;
		
		Если РеквизитыВида.ВестиУчетТоваровИУслуг И Объект.Товары.Количество() > 0 Тогда
			КоличествоПозиций = Объект.Товары.Количество();
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Товары и услуги:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=%1>%2</A><BR>",
				"v8doc:tasks/goods?ref=" + Строка(Объект.Ссылка.УникальныйИдентификатор()),
				Формат(КоличествоПозиций, "ЧГ=") + " "
				+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(КоличествоПозиций,
					"Л = ru_RU", НСтр("ru = 'позиция,позиции,позиций,,,,,,0'")));
		КонецЕсли;
		
		Если РеквизитыВида.ВестиУчетПоСтатьямДДС Тогда
			СтатьиДДС = Форма.СтатьиДвиженияДенежныхСредств;
			КоличествоСтатей = СтатьиДДС.Количество();
			Если КоличествоСтатей = 1 Тогда
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Статья ДДС:'"), 
					СтатьиДДС[0].СтатьяДвиженияДенежныхСредств);
			ИначеЕсли КоличествоСтатей > 1 Тогда
				ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Статьи ДДС:'"));
				Разделитель = "";
				Для каждого Строка из СтатьиДДС Цикл
					HTMLТекст = HTMLТекст + Разделитель;
					ДобавитьЗначение(HTMLТекст, Строка.СтатьяДвиженияДенежныхСредств, "");
					Разделитель = "; ";
				КонецЦикла;
				HTMLТекст = HTMLТекст + "<br>";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РеквизитыВида.УчитыватьСрокДействия Тогда
		СрокДействияСтрока = Форма.СрокДействияСтрока;
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Срок действия:'"));
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"period",
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(?(ЗначениеЗаполнено(СрокДействияСтрока),
				СрокДействияСтрока, НСтр("ru = 'не указан'"))));
	КонецЕсли;
	
	Если РеквизитыВида.УчитыватьНедействующиеДокументы Тогда
		Если Объект.НеДействует Тогда
			
			НеДействуетВСоответствии = СвязиОбъектов.ПолучитьСвязанныйОбъект(
				Объект.Ссылка, Справочники.ТипыСвязей.НеДействуетВСоответствии);
				
			Если ЗначениеЗаполнено(НеДействуетВСоответствии) Тогда 
				Ответ = Строка(НеДействуетВСоответствии);
			Иначе 
				Ответ = НСтр("ru = 'Да'");
			КонецЕсли;
			
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Не действует в соответствии с:'"), Ответ, "696969");
			
		КонецЕсли;
	КонецЕсли;
	
	Если Делопроизводство.ЭтотВидДокументаМожноОтменить(Объект.ВидДокумента) Тогда
		
		ГотовитсяКОтменеДокументы = РегистрыСведений.ОтменяемыеДокументы.ПрочитатьНовыеДокументы(Объект.Ссылка);
		Если ГотовитсяКОтменеДокументы.Количество() <> 0 Тогда
			
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Готовится к отмене документом:'"));
			
			Для Каждого Строка Из ГотовитсяКОтменеДокументы Цикл
				ДобавитьЗначение(HTMLТекст, Строка.Документ); 
				HTMLТекст = HTMLТекст + "&nbsp;";
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	//++Кузнецов
	АСК_ДобавитьДополнительныеРеквизиты (HTMLТекст, Объект, Форма, "Первичка");
	//--Кузнецов отключил стандартьную
	//ДобавитьОбзорДополнительныхРеквизитов(HTMLТекст, Объект, Форма);
	
	HTMLТекст = HTMLТекст + "</td></tr>";	
	
	Если РеквизитыВида.ВестиУчетПоКонтрагентам 
		И (ЗначениеЗаполнено(Объект.Контрагент) 
			Или Объект.Контрагенты.Количество()
			Или РеквизитыВида.ЯвляетсяЗаявкойНаОплату) Тогда
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" >";
		HTMLТекст = HTMLТекст + "<p>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td width=""70%"">"; 
		//++Кузнецов убрал организацию
		//Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям")
		//	И Не РеквизитыВида.ВестиУчетПоОрганизациям Тогда
		//	HTMLТекст = HTMLТекст + "<p>";
		//	ДобавитьРеквизит(HTMLТекст, РедакцииКонфигурацииКлиентСервер.ИмяОрганизацииУчетСторон(), "");
		//Иначе
		//	HTMLТекст = HTMLТекст + "<p>";
		//	ДобавитьРеквизит(HTMLТекст, РедакцииКонфигурацииКлиентСервер.ИмяОрганизации(), "");
		//	HTMLТекст = HTMLТекст + "<p>";
		//	ДобавитьРеквизит(HTMLТекст, "", Организация, "", Юрлица.ПредставлениеЮрлицаНаДату(Организация, ДатаНачалаОтсчета));
		//КонецЕсли;
		//--Кузнецов
		
		Если Не Форма.НесколькоКонтрагентов Тогда
			//++Кузнецов
			//HTMLТекст = HTMLТекст + "<td>";
			//HTMLТекст = HTMLТекст + "<p>";	
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Контрагент:'"), ""); 
			//++Кузнецов
			//HTMLТекст = HTMLТекст + "<p>";
			
			Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
				КонтрагентПредставление = Справочники.Контрагенты.ПредставлениеКонтрагентаНаДату(Объект.Контрагент, ДатаНачалаОтсчета);
				ДобавитьРеквизит(HTMLТекст, "", Объект.Контрагент, "", КонтрагентПредставление);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ПодписалОтКонтрагента) Тогда
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подписал:'"), Объект.ПодписалОтКонтрагента);
			КонецЕсли;	
			
			ДобавитьВТекстДанныеКонтактногоЛица(Объект.КонтактноеЛицо, HTMLТекст, НСтр("ru = 'Контакт:'"));
		Иначе
			//++Кузнецов
			//HTMLТекст = HTMLТекст + "<td>";
			//HTMLТекст = HTMLТекст + "<p>";
			Количество = 0;
			Для Каждого СтрокаКонтрагент Из Объект.Контрагенты Цикл
				Если ЗначениеЗаполнено(СтрокаКонтрагент.Контрагент) Тогда
					Количество = Количество + 1;
				КонецЕсли;
			КонецЦикла;
			
			Если Количество = 1 Тогда 
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Контрагент:'"), "");
			Иначе 
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Контрагенты:'"), "");
			КонецЕсли;
			
			//++Кузнецов
			//HTMLТекст = HTMLТекст + "<p>";
			
			Для Каждого СтрокаКонтрагент Из Объект.Контрагенты Цикл
				Если ЗначениеЗаполнено(СтрокаКонтрагент.Контрагент) Тогда
					КонтрагентПредставление = Справочники.Контрагенты.ПредставлениеКонтрагентаНаДату(СтрокаКонтрагент.Контрагент, ДатаНачалаОтсчета);
					ДобавитьРеквизит(HTMLТекст, "", СтрокаКонтрагент.Контрагент, , КонтрагентПредставление);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаКонтрагент.ПодписалОтКонтрагента) Тогда
					ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подписал:'"), СтрокаКонтрагент.ПодписалОтКонтрагента);
				КонецЕсли;	
				
				ДобавитьВТекстДанныеКонтактногоЛица(СтрокаКонтрагент.КонтактноеЛицо, HTMLТекст, НСтр("ru = 'Контакт:'"));
								
				HTMLТекст = HTMLТекст + "<p>";	
			КонецЦикла;	
			
			// Удаление лишнего отступа
			HTMLТекст = Лев(HTMLТекст, СтрДлина(HTMLТекст)-3);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td></tr>";
	ИначеЕсли РеквизитыВида.ВестиУчетСторон И Объект.Стороны.Количество() Тогда
		
		Стороны = Новый Массив(2);
		СтрокиОрганизации = Новый Массив;
		СтрокиКонтрагенты = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из Объект.Стороны Цикл
			Если РаботаСПодписямиДокументовКлиентСервер.ЭтоОрганизация(СтрокаТаблицы.Сторона) Тогда
				СтрокиОрганизации.Добавить(СтрокаТаблицы);
			Иначе
				СтрокиКонтрагенты.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокиКонтрагенты.Количество() Тогда
			ИндексПоследнего = СтрокиОрганизации.ВГраница();
			Для Счетчик = 1 По ИндексПоследнего Цикл
				СтрокиКонтрагенты.Добавить(СтрокиОрганизации[Счетчик]);
			КонецЦикла;
			Для Счетчик = 0 По ИндексПоследнего - 1 Цикл
				СтрокиОрганизации.Удалить(ИндексПоследнего - Счетчик);
			КонецЦикла;
		КонецЕсли;
		
		Стороны[0] = СтрокиОрганизации;
		Стороны[1] = СтрокиКонтрагенты;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'СТОРОНЫ'"), "");
		HTMLТекст = HTMLТекст + "</td></tr>";

		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td width=""70%"">";
		
		Для Каждого Сторона Из Стороны Цикл
			Для Каждого ОписаниеСтороны Из Сторона Цикл			
				Если ЗначениеЗаполнено(ОписаниеСтороны.Наименование) Тогда
					ДобавитьРеквизит(HTMLТекст, СокрЛП(ОписаниеСтороны.Наименование) + ":", "");
				КонецЕсли;
				
				СведенияОЮрлице = Юрлица.СведенияОЮрлицеНаДату(ОписаниеСтороны.Сторона, ДатаНачалаОтсчета);
				ДобавитьРеквизит(HTMLТекст, "", ОписаниеСтороны.Сторона, "", СведенияОЮрлице.ПредставлениеПолное);
				
				Если ОписаниеСтороны.Подписан Тогда
					Подписант = ОписаниеСтороны.Подписал;
					Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОписаниеСтороны.Сторона, "ЮрФизЛицо") = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
						Подписант = ОписаниеСтороны.Сторона;
					КонецЕсли;
					
					ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подписал:'"), Подписант);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОписаниеСтороны.КонтактноеЛицо) Тогда
					ДобавитьВТекстДанныеКонтактногоЛица(ОписаниеСтороны.КонтактноеЛицо, HTMLТекст, НСтр("ru = 'Контакт:'"));
				КонецЕсли;
				
				HTMLТекст = HTMLТекст + "<p>";
			КонецЦикла;	
			HTMLТекст = HTMLТекст + "</td><td>";
		КонецЦикла;
				
		HTMLТекст = HTMLТекст + "</td></tr>";
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	//++Кузнецов перенес из другого места	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") И ЗначениеЗаполнено(Объект.Проект) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Проект:'"),  Объект.Проект);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Состояние:'"));
		HTMLТекст = HTMLТекст + СтрШаблон(
		"<A href=v8doc:%1>%2</A><BR>",
		"status",
		Форма.СостояниеТекст);
	КонецЕсли;
	//--Кузнецов
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если ЗначениеЗаполнено(Объект.Подготовил) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Подготовил:'"));
		ДобавитьЗначение(HTMLТекст, Объект.Подготовил, "");
		ДобавитьЗначение(HTMLТекст, " (" + Формат(Объект.ДатаСоздания, "ДЛФ=D") + ")", "");
		HTMLТекст = HTMLТекст + "<br>";
		
		КонтактнаяИнформация = ПолучитьКонтактнуюИнформациюОбъекта(Объект.Подготовил);
		
		Если ЗначениеЗаполнено(КонтактнаяИнформация.Телефон) Тогда
			ДобавитьРеквизит(HTMLТекст, "", КонтактнаяИнформация.Телефон, "696969");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактнаяИнформация.Емайл) Тогда
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<FONT color=#696969>%1</FONT>",
				НСтр("ru = 'E-mail:'") + " ");
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A color=#696969 href=v8doc:%1><FONT color=#696969>%2</FONT></A><BR>",
				"message"+КонтактнаяИнформация.Емайл,
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(КонтактнаяИнформация.Емайл));
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подразделение:'"),  Объект.Подразделение);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Ответственный:'"),  Объект.Ответственный);
	КонецЕсли; 
	
	//++Кузнецов перенес из другого места
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСвязиОбъектов") Тогда
		
		КраткиеСведенияОСвязях = СвязиОбъектов.КраткиеСведенияОСвязях(Объект.Ссылка);
			
		Если Не ЗначениеЗаполнено(КраткиеСведенияОСвязях) Тогда	
			КраткиеСведенияОСвязях = НСтр("ru = 'Связи: не заданы'");
		КонецЕсли;	
			
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<b><A href=v8doc:tasks/ShowLinks/%1>%2</A></b> <br>",
			ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(КраткиеСведенияОСвязях));
	КонецЕсли; 
	//--Кузнецов

	//++Кузнецов
	АСК_ДобавитьДополнительныеРеквизиты (HTMLТекст, Объект, Форма, "ЗагруженАвтоматически");
	//--Кузнецов
		
	Если РеквизитыВида.КонтролироватьНаличиеОригинала И ЗначениеЗаполнено(Форма.ОригиналПолученТекст) Тогда 
		Если Не Форма.ОригиналПолучен И ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда 
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Оригинал:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1><FONT color=#%2>%3</FONT></A><BR>",
				"Original",
				"B22222",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Форма.ОригиналПолученТекст));
		Иначе 
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Оригинал:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A><BR>",
				"Original",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Форма.ОригиналПолученТекст));
		КонецЕсли;
	КонецЕсли;
	
	//++Кузнецов отключил
	//Если ЗначениеЗаполнено(Объект.ФормаДокумента) Тогда 
	//	ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Форма:'"), Объект.ФормаДокумента);
	//КонецЕсли;
	
	МестоХраненияДокументаИспользуется = РеквизитыХраненияИспользуются(
		РеквизитыВида.УчитыватьМестоХранения, Объект.МестоХранения, Объект.ФормаДокумента);
		
	СостояниеДела = Неопределено;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруДел") Тогда 
		Если РеквизитыВида.ВестиУчетПоНоменклатуреДел И ЗначениеЗаполнено(Объект.НоменклатураДел) Тогда
			ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Номенклатура дел:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A><BR>",
				ПолучитьНавигационнуюСсылку(Объект.НоменклатураДел),
				Объект.НоменклатураДел);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Дело) Тогда
			ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Помещен в дело:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A><BR>",
				"dossier",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Строка(Объект.Дело)));
			
			СостояниеДела = Форма.СтруктураСостоянияДела;
			Если ТипЗнч(СостояниеДела) = Тип("Структура")
				И ЗначениеЗаполнено(СостояниеДела.Состояние) Тогда
				HTMLТекст = HTMLТекст + СтрШаблон(
					"<A href=v8doc:%1>%2</A><BR></FONT>",
					"DossierStatusRecorder",
					РаботаС_HTML.ЗаменитьСпецСимволыHTML(
						СостояниеДела.ПредставлениеСостояния + " " + СостояниеДела.ДатаСостояния));
			КонецЕсли;
			
			МестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Дело, "МестоХраненияДел");
			Если ЗначениеЗаполнено(МестоХранения) Тогда
				МестоХраненияТекст = ДелопроизводствоКлиентСервер.ПолучитьПолныйПутьКМестуХранения(МестоХранения,
					ПолучитьФункциональнуюОпцию("ИспользоватьСхемыПомещений"));
				Если МестоХраненияДокументаИспользуется Тогда
					ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Место хранения дела:'"));
				Иначе
					ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Место хранения:'"));
				КонецЕсли;
				HTMLТекст = HTMLТекст + СтрШаблон(
					"<A href=v8doc:%1>%2</A><BR>",
					"storage",
					РаботаС_HTML.ЗаменитьСпецСимволыHTML(МестоХраненияТекст));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если МестоХраненияДокументаИспользуется Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Место хранения:'"), Объект.МестоХранения);
	КонецЕсли;
	
	Если РеквизитыХраненияИспользуются(
		РеквизитыВида.УчитыватьОтветственногоЗаХранение, Объект.ОтветственныйЗаХранение, Объект.ФормаДокумента) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Отв. за хранение:'"), Объект.ОтветственныйЗаХранение);
	КонецЕсли;
	
	КомуПереданДокумент = Форма.КомуПереданДокумент;
	Если ЗначениеЗаполнено(КомуПереданДокумент) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Передан:'"));
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"holder",
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(КомуПереданДокумент));
	КонецЕсли;	
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если РеквизитыВида.ИспользоватьВременныеНомера 
		И ЗначениеЗаполнено(Объект.ВременныйНомер) Тогда
		// Выводим врем. номер в реквизитах, если заполнен рег. номер, иначе он будет на месте рег. номера
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Врем. №:'"), Объект.ВременныйНомер);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПапкиДокументов") Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Папка:'"), 	Объект.Папка);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа") Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Гриф:'"),  Объект.ГрифДоступа);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности") Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Вопрос:'"),  Объект.ВопросДеятельности);
	КонецЕсли;
	
	//++Кузнецов перенес
	//Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") И ЗначениеЗаполнено(Объект.Проект) Тогда 
	//	ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Проект:'"),  Объект.Проект);
	//КонецЕсли;

	//Если ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
	//	ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Состояние:'"));
	//	HTMLТекст = HTMLТекст + СтрШаблон(
	//		"<A href=v8doc:%1>%2</A><BR>",
	//		"status",
	//		Форма.СостояниеТекст);
	//КонецЕсли;
	//--Кузнецов
	
	// Локализация
	ИспользоватьОбменЭД = ОбщегоНазначенияБЭД.ЗначениеФункциональнойОпции("ИспользоватьОбменЭД");
	Если ИспользоватьОбменЭД И ЗначениеЗаполнено(Форма.СостояниеЭДО) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Состояние ЭДО:'"));  

		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"OpenEDI",
			Форма.СостояниеЭДО);
	КонецЕсли;
	
	ИспользоватьРПД =  ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек");
	Если ИспользоватьРПД И РаспознаваниеДокументовСлужебный.ВыводитьСтатусРаспознаванияВОбзоре(Форма) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Статус распознавания:'"));

		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"RecognitionHistory",
			Форма.СтатусРаспознаванияДокумента);
	КонецЕсли;
	// Локализация Конец
	
	Если ЗначениеЗаполнено(Форма.УтверждениеТекст) Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Утвержден:'"), Форма.УтверждениеТекст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ПодписьТекст) Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подписан:'"), Форма.ПодписьТекст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Комментарий:'"),  Объект.Комментарий);
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td></tr>";	
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	HTMLТекст = HTMLТекст + "<p>";
	
	ОбзорОбъектов.ВставитьСсылкиНаВнешниеОбъекты(Объект.Ссылка, HTMLТекст);
	
	Если ЗначениеЗаполнено(СостояниеДела)
		И ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом")
		И СостояниеДела.Состояние = Перечисления.СостоянияДелХраненияДокументов.ПереданоВАрхив
		И СостояниеДела.ПереданоВ1САрхив = Истина Тогда
		ЭтоЭлектронныйДокумент = Объект.ФормаДокумента = Перечисления.ВариантыФормДокументов.Электронная;
		HTMLТекст = HTMLТекст + "<p>" + " " +  "<p>" + СтрШаблон(
			"<U><B><A href=v8doc:%1>%2</A><BR></B></U>",
			"DownloadContainer",
			СтрШаблон(НСтр("ru = 'Скачать %1 из 1С:Архива...'"),
				?(ЭтоЭлектронныйДокумент, НСтр("ru = 'контейнер'"), НСтр("ru = 'файлы'"))));
	КонецЕсли;
	
	Если Не Форма.НеПоказыватьДанныеОбработки Тогда
		ДобавитьОбзорРезультатов(HTMLТекст, Объект);
	КонецЕсли;
	HTMLТекст = HTMLТекст + "</td></tr>";
	HTMLТекст = HTMLТекст + "</table>";
	
	HTMLТекст = HTMLТекст + "</body></html>";
	
	ОбзорОбъектовКлиентСервер.УдалитьВредоносныйКодИзТекста(HTMLТекст);
	
	Возврат HTMLТекст;
	
КонецФункции

Функция аск_ФормироватьHTMLБезКонтрагента(Форма)  
	Объект = Форма.Объект;
	Организация = Объект.Организация;
	Шаблон = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(Объект.Ссылка,
		"Шаблон");
	ДатаНачалаОтсчета = Делопроизводство.ДатаУчетаДокумента(Объект);
	
	
	Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда 
		КэшДокументыПредприятияФормаЭлемента =
			КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
		Если КэшДокументыПредприятияФормаЭлемента.Инициализирован
			И КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента = Объект.ВидДокумента Тогда
			РеквизитыВида = КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента;
		Иначе
			РеквизитыВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидДокумента,
				"УчитыватьСуммуДокумента, ИспользоватьСрокИсполнения, ВестиУчетПоНоменклатуреДел, УчитыватьСрокДействия,
				|УчитыватьНедействующиеДокументы, ВестиУчетТоваровИУслуг, ВестиУчетПоСтатьямДДС, ВестиУчетПоОрганизациям,
				|ВестиУчетСторон,
				|УчитыватьМестоХранения, УчитыватьОтветственногоЗаХранение, КонтролироватьНаличиеОригинала, 
				|ВестиУчетПоТематикам, СрокИсполненияУказанВРабочихДнях, ИспользоватьВременныеНомера");
		КонецЕсли;
	Иначе 
		РеквизитыВида = Новый Структура;
		РеквизитыВида.Вставить("УчитыватьСуммуДокумента", Ложь);
		РеквизитыВида.Вставить("ВестиУчетТоваровИУслуг", Ложь);
		РеквизитыВида.Вставить("ИспользоватьСрокИсполнения", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоНоменклатуреДел", Ложь);
		РеквизитыВида.Вставить("УчитыватьСрокДействия", Ложь);
		РеквизитыВида.Вставить("УчитыватьНедействующиеДокументы", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоСтатьямДДС", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоОрганизациям", Ложь);
		РеквизитыВида.Вставить("ВестиУчетСторон", Ложь);
		РеквизитыВида.Вставить("УчитыватьМестоХранения", Ложь);
		РеквизитыВида.Вставить("УчитыватьОтветственногоЗаХранение", Ложь);
		РеквизитыВида.Вставить("КонтролироватьНаличиеОригинала", Ложь);
		РеквизитыВида.Вставить("ВестиУчетПоТематикам", Ложь);
		РеквизитыВида.Вставить("СрокИсполненияУказанВРабочихДнях", Ложь);
		РеквизитыВида.Вставить("ИспользоватьВременныеНомера", Ложь);
	КонецЕсли;
	
	// Формируем основное представление документа	
	HTMLТекст = "<html>
	|<head>
	|<style type=""text/css"">
	|	body {
	|		overflow:    auto;
	|		margin-top:  6px; 		 
	|		margin-left: 10px;
	|		margin-bottom: 0px;
	|		font-family: Arial, sans-serif;
	|		font-size:   10pt;}
	|	table {
	|		width:       100%; 
	|		font-family: Arial, sans-serif;
	|		font-size:   10pt;}
	|	td {vertical-align: top;}
	| 	a:link {
	|		color: #006699; text-decoration: none;}
	|	a:visited {
	|		color: #006699; text-decoration: none;}
	|	a:hover {
	|		color: #006699; text-decoration: underline;}
	|	p {
	|		margin-top: 7px;}
	|</style>
	|<body>";
	
	HTMLТекст = HTMLТекст + "<table>";
	
	//Если ЗначениеЗаполнено(Организация)
	//	И (РеквизитыВида.ВестиУчетПоОрганизациям
	//		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям")) Тогда
	//	HTMLТекст = HTMLТекст + "<tr>";
	//	HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
	//	ОрганизацияПредставление = Юрлица.ПредставлениеЮрлицаНаДату(Организация, ДатаНачалаОтсчета);
	//	ДобавитьРеквизит(HTMLТекст, "", Организация, , ОрганизацияПредставление);
	//	HTMLТекст = HTMLТекст + "</td>";
	//	HTMLТекст = HTMLТекст + "</tr>";
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда 
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
		HTMLТекст = HTMLТекст + "<p>";
		
		Если РеквизитыВида.ВестиУчетПоТематикам И ЗначениеЗаполнено(Объект.Тематика) Тогда 
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A> - <A href=v8doc:%3>%4</A>",
				ПолучитьНавигационнуюСсылку(Объект.ВидДокумента),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ВРег((Строка(Объект.ВидДокумента)))),
				ПолучитьНавигационнуюСсылку(Объект.Тематика),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ВРег((Строка(Объект.Тематика)))));
		Иначе
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A>",
				ПолучитьНавигационнуюСсылку(Объект.ВидДокумента),
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(ВРег((Строка(Объект.ВидДокумента)))));
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td width=""70%"">";
	Если ЗначениеЗаполнено(Объект.ДатаРегистрации) Тогда 
		ДобавитьРеквизит(HTMLТекст, "", Формат(Объект.ДатаРегистрации, "ДЛФ=D"));
	Иначе
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = '____________'"), "");
	КонецЕсли;
	HTMLТекст = HTMLТекст + "</td>";
	
    HTMLТекст = HTMLТекст + "<td>";
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = '№ '"), Объект.РегистрационныйНомер);
	Иначе
		Если РеквизитыВида.ИспользоватьВременныеНомера И ЗначениеЗаполнено(Объект.ВременныйНомер) Тогда
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Врем. № '"), Объект.ВременныйНомер);
		Иначе
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = '№___________'"), "");
		КонецЕсли;
	КонецЕсли;	
	HTMLТекст = HTMLТекст + "</td>";
	HTMLТекст = HTMLТекст + "</tr>";
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	Заголовок = Объект.Заголовок;
	HTMLТекст = HTMLТекст + СтрШаблон(
		"<B>%1</B>",
		РаботаС_HTML.ЗаменитьСпецСимволыHTML(Заголовок));
	HTMLТекст = HTMLТекст + "<p>";
	
	HTMLТекст = HTMLТекст + "<p>";	
	Если ЗначениеЗаполнено(Объект.Содержание) Тогда
		Содержание = Объект.Содержание;
		HTMLТекст = HTMLТекст + СтрЗаменить(РаботаС_HTML.ЗаменитьСпецСимволыHTML(Содержание), Символы.ПС, "<br>");
		HTMLТекст = HTMLТекст + "<p>";
	КонецЕсли;

	////++Кузнецов перенес
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьСвязиОбъектов") Тогда                  
	//	
	//	КраткиеСведенияОСвязях = СвязиОбъектов.КраткиеСведенияОСвязях(Объект.Ссылка);
	//		
	//	Если Не ЗначениеЗаполнено(КраткиеСведенияОСвязях) Тогда	
	//		КраткиеСведенияОСвязях = НСтр("ru = 'Связи: не заданы'");
	//	КонецЕсли;	
	//	
	//	HTMLТекст = HTMLТекст + СтрШаблон(
	//		"<b><A href=v8doc:tasks/ShowLinks/%1>%2</A></b> <br>",
	//		ПолучитьНавигационнуюСсылку(Объект.Ссылка),
	//		РаботаС_HTML.ЗаменитьСпецСимволыHTML(КраткиеСведенияОСвязях));
	//КонецЕсли;	
	
	ДобавитьНадписьОСроке(HTMLТекст, Объект, РеквизитыВида, ДатаНачалаОтсчета, НСтр("ru = 'Срок исполнения:'"));
	
	// Сумма и статьи ДДС.
	Если РеквизитыВида.УчитыватьСуммуДокумента Тогда
		Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Валюта, "Наименование");
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Сумма:'"), Формат(Объект.Сумма, "ЧДЦ=2; ЧН=0") + " " + 
			Валюта);
			
		Если Форма.УчитыватьНДС Тогда 
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Сумма НДС:'"), Формат(Объект.СуммаНДС, "ЧДЦ=2; ЧН=0") + " " + 
				Валюта);
		КонецЕсли;
		
		Если РеквизитыВида.ВестиУчетТоваровИУслуг И Объект.Товары.Количество() > 0 Тогда
			КоличествоПозиций = Объект.Товары.Количество();
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Товары и услуги:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=%1>%2</A><BR>",
				"v8doc:tasks/goods?ref=" + Строка(Объект.Ссылка.УникальныйИдентификатор()),
				Формат(КоличествоПозиций, "ЧГ=") + " "
				+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(КоличествоПозиций,
					"Л = ru_RU", НСтр("ru = 'позиция,позиции,позиций,,,,,,0'")));
		КонецЕсли;
		
		Если РеквизитыВида.ВестиУчетПоСтатьямДДС Тогда
			СтатьиДДС = Форма.СтатьиДвиженияДенежныхСредств;
			КоличествоСтатей = СтатьиДДС.Количество();
			Если КоличествоСтатей = 1 Тогда
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Статья ДДС:'"), 
					СтатьиДДС[0].СтатьяДвиженияДенежныхСредств);
			ИначеЕсли КоличествоСтатей > 1 Тогда
				ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Статьи ДДС:'"));
				Разделитель = "";
				Для каждого Строка из СтатьиДДС Цикл
					HTMLТекст = HTMLТекст + Разделитель;
					ДобавитьЗначение(HTMLТекст, Строка.СтатьяДвиженияДенежныхСредств, "");
					Разделитель = "; ";
				КонецЦикла;
				HTMLТекст = HTMLТекст + "<br>";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если РеквизитыВида.УчитыватьСрокДействия Тогда
		СрокДействияСтрока = Форма.СрокДействияСтрока;
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Срок действия:'"));
		
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"period",
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(?(ЗначениеЗаполнено(СрокДействияСтрока),
				СрокДействияСтрока, НСтр("ru = 'не указан'"))));
	КонецЕсли;
	
	Если РеквизитыВида.УчитыватьНедействующиеДокументы Тогда
		Если Объект.НеДействует Тогда
			
			НеДействуетВСоответствии = СвязиОбъектов.ПолучитьСвязанныйОбъект(
				Объект.Ссылка, Справочники.ТипыСвязей.НеДействуетВСоответствии);
				
			Если ЗначениеЗаполнено(НеДействуетВСоответствии) Тогда 
				Ответ = Строка(НеДействуетВСоответствии);
			Иначе 
				Ответ = НСтр("ru = 'Да'");
			КонецЕсли;
			
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Не действует в соответствии с:'"), Ответ, "696969");
			
		КонецЕсли;
	КонецЕсли;
	
	Если Делопроизводство.ЭтотВидДокументаМожноОтменить(Объект.ВидДокумента) Тогда
		
		ГотовитсяКОтменеДокументы = РегистрыСведений.ОтменяемыеДокументы.ПрочитатьНовыеДокументы(Объект.Ссылка);
		Если ГотовитсяКОтменеДокументы.Количество() <> 0 Тогда
			
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Готовится к отмене документом:'"));
			
			Для Каждого Строка Из ГотовитсяКОтменеДокументы Цикл
				ДобавитьЗначение(HTMLТекст, Строка.Документ); 
				HTMLТекст = HTMLТекст + "&nbsp;";
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	//++Кузнецов Заменил на свою функцию	
	//ДобавитьОбзорДополнительныхРеквизитов(HTMLТекст, Объект, Форма);
	АСК_ДобавитьДополнительныеРеквизиты (HTMLТекст, Объект, Форма,"Первичка");
	
	HTMLТекст = HTMLТекст + "</td></tr>";	
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td>";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	//++Кузнецов из другого места
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") И ЗначениеЗаполнено(Объект.Проект) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Проект:'"),  Объект.Проект);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Состояние:'"));
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"status",
			Форма.СостояниеТекст);
	КонецЕсли; 
	//--Кузнецов
		
	Если ЗначениеЗаполнено(Объект.Подготовил) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Подготовил:'"));
		ДобавитьЗначение(HTMLТекст, Объект.Подготовил, "");
		ДобавитьЗначение(HTMLТекст, " (" + Формат(Объект.ДатаСоздания, "ДЛФ=D") + ")", "");
		HTMLТекст = HTMLТекст + "<br>";
		
		КонтактнаяИнформация = ПолучитьКонтактнуюИнформациюОбъекта(Объект.Подготовил);
		
		Если ЗначениеЗаполнено(КонтактнаяИнформация.Телефон) Тогда
			ДобавитьРеквизит(HTMLТекст, "", КонтактнаяИнформация.Телефон, "696969");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактнаяИнформация.Емайл) Тогда
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<FONT color=#696969>%1</FONT>",
				НСтр("ru = 'E-mail:'") + " ");
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A color=#696969 href=v8doc:%1><FONT color=#696969>%2</FONT></A><BR>",
				"message"+КонтактнаяИнформация.Емайл,
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(КонтактнаяИнформация.Емайл));
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подразделение:'"),  Объект.Подразделение);
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td>";
	HTMLТекст = HTMLТекст + "</tr>";
	
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Ответственный:'"),  Объект.Ответственный);
	КонецЕсли;
	
	//++Кузнецов из другого места взял
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСвязиОбъектов") Тогда                  
		
		КраткиеСведенияОСвязях = СвязиОбъектов.КраткиеСведенияОСвязях(Объект.Ссылка);
			
		Если Не ЗначениеЗаполнено(КраткиеСведенияОСвязях) Тогда	
			КраткиеСведенияОСвязях = НСтр("ru = 'Связи: не заданы'");
		КонецЕсли;	
		
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<b><A href=v8doc:tasks/ShowLinks/%1>%2</A></b> <br>",
			ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(КраткиеСведенияОСвязях));
	КонецЕсли;
	
	//++Кузнецов
	АСК_ДобавитьДополнительныеРеквизиты (HTMLТекст, Объект, Форма, "ЗагруженАвтоматически");
	//--Кузнецов
	
	Если РеквизитыВида.КонтролироватьНаличиеОригинала И ЗначениеЗаполнено(Форма.ОригиналПолученТекст) Тогда 
		Если Не Форма.ОригиналПолучен И ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда 
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Оригинал:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1><FONT color=#%2>%3</FONT></A><BR>",
				"Original",
				"B22222",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Форма.ОригиналПолученТекст));
		Иначе 
			ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Оригинал:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A><BR>",
				"Original",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Форма.ОригиналПолученТекст));
		КонецЕсли;
	КонецЕсли;
	
	//++Кузнецов отключил
	//Если ЗначениеЗаполнено(Объект.ФормаДокумента) Тогда 
	//	ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Форма:'"), Объект.ФормаДокумента);
	//КонецЕсли;
	
	МестоХраненияДокументаИспользуется = РеквизитыХраненияИспользуются(
		РеквизитыВида.УчитыватьМестоХранения, Объект.МестоХранения, Объект.ФормаДокумента);
	
	СостояниеДела = Неопределено;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруДел") Тогда 
		Если РеквизитыВида.ВестиУчетПоНоменклатуреДел И ЗначениеЗаполнено(Объект.НоменклатураДел) Тогда
			ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Номенклатура дел:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A><BR>",
				ПолучитьНавигационнуюСсылку(Объект.НоменклатураДел),
				Объект.НоменклатураДел);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Дело) Тогда
			ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Помещен в дело:'"));
			HTMLТекст = HTMLТекст + СтрШаблон(
				"<A href=v8doc:%1>%2</A><BR>",
				"dossier",
				РаботаС_HTML.ЗаменитьСпецСимволыHTML(Строка(Объект.Дело)));
				
			СостояниеДела = Форма.СтруктураСостоянияДела;
			Если ТипЗнч(СостояниеДела) = Тип("Структура")
				И ЗначениеЗаполнено(СостояниеДела.Состояние) Тогда
				HTMLТекст = HTMLТекст + СтрШаблон(
					"<A href=v8doc:%1>%2</A><BR></FONT>",
					"DossierStatusRecorder",
					РаботаС_HTML.ЗаменитьСпецСимволыHTML(
						СостояниеДела.ПредставлениеСостояния + " " + СостояниеДела.ДатаСостояния));
			КонецЕсли;
			
			МестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Дело, "МестоХраненияДел");
			Если ЗначениеЗаполнено(МестоХранения) Тогда
				МестоХраненияТекст = ДелопроизводствоКлиентСервер.ПолучитьПолныйПутьКМестуХранения(МестоХранения,
					ПолучитьФункциональнуюОпцию("ИспользоватьСхемыПомещений"));
				Если МестоХраненияДокументаИспользуется Тогда
					ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Место хранения дела:'"));
				Иначе
					ДобавитьПодпись(HTMLТекст,  НСтр("ru = 'Место хранения:'"));
				КонецЕсли;
				HTMLТекст = HTMLТекст + СтрШаблон(
					"<A href=v8doc:%1>%2</A><BR>",
					"storage",
					РаботаС_HTML.ЗаменитьСпецСимволыHTML(МестоХраненияТекст));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если МестоХраненияДокументаИспользуется Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Место хранения:'"), Объект.МестоХранения);
	КонецЕсли;
	
	Если РеквизитыХраненияИспользуются(
		РеквизитыВида.УчитыватьОтветственногоЗаХранение, Объект.ОтветственныйЗаХранение, Объект.ФормаДокумента) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Отв. за хранение:'"), Объект.ОтветственныйЗаХранение);
	КонецЕсли;
	
	КомуПереданДокумент = Форма.КомуПереданДокумент;
	Если ЗначениеЗаполнено(КомуПереданДокумент) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Передан:'"));
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"holder",
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(КомуПереданДокумент));
	КонецЕсли;	
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если РеквизитыВида.ИспользоватьВременныеНомера
		И ЗначениеЗаполнено(Объект.ВременныйНомер) Тогда
		// Выводим врем. номер в реквизитах, если заполнен рег. номер, иначе он будет на месте рег. номера
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Врем. №:'"), Объект.ВременныйНомер);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПапкиДокументов")Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Папка:'"), 	Объект.Папка);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа") Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Гриф:'"),  Объект.ГрифДоступа);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности") Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Вопрос:'"),  Объект.ВопросДеятельности);
	КонецЕсли;
	
	//++Кузнецов перенес
	//Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") И ЗначениеЗаполнено(Объект.Проект) Тогда 
	//	ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Проект:'"),  Объект.Проект);
	//КонецЕсли;
	//
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
	//	ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Состояние:'"));
	//	HTMLТекст = HTMLТекст + СтрШаблон(
	//		"<A href=v8doc:%1>%2</A><BR>",
	//		"status",
	//		Форма.СостояниеТекст);
	//КонецЕсли;
	
	// Локализация
	ИспользоватьОбменЭД = ОбщегоНазначенияБЭД.ЗначениеФункциональнойОпции("ИспользоватьОбменЭД");
	Если ИспользоватьОбменЭД И ЗначениеЗаполнено(Форма.СостояниеЭДО) Тогда  
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Состояние ЭДО:'"));  
		
		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"OpenEDI",
			Форма.СостояниеЭДО);
	КонецЕсли;
	
	ИспользоватьРПД =  ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек");
	Если ИспользоватьРПД И РаспознаваниеДокументовСлужебный.ВыводитьСтатусРаспознаванияВОбзоре(Форма) Тогда
		ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Статус распознавания:'"));

		HTMLТекст = HTMLТекст + СтрШаблон(
			"<A href=v8doc:%1>%2</A><BR>",
			"RecognitionHistory",
			Форма.СтатусРаспознаванияДокумента);
	КонецЕсли;
	// Локализация Конец
	
	Если ЗначениеЗаполнено(Форма.УтверждениеТекст) Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Утвержден:'"), Форма.УтверждениеТекст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ПодписьТекст) Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Подписан:'"), Форма.ПодписьТекст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда 
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Комментарий:'"),  Объект.Комментарий);
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td></tr>";	
	
	HTMLТекст = HTMLТекст + "<tr>";
    HTMLТекст = HTMLТекст + "<td colspan=""2"">";
	HTMLТекст = HTMLТекст + "<p>";
	
	ОбзорОбъектов.ВставитьСсылкиНаВнешниеОбъекты(Объект.Ссылка, HTMLТекст);
	
	Если ЗначениеЗаполнено(СостояниеДела)
		И ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом")
		И СостояниеДела.Состояние = Перечисления.СостоянияДелХраненияДокументов.ПереданоВАрхив
		И СостояниеДела.ПереданоВ1САрхив = Истина Тогда
		ЭтоЭлектронныйДокумент = Объект.ФормаДокумента = Перечисления.ВариантыФормДокументов.Электронная;
		HTMLТекст = HTMLТекст + "<p>" + " " +  "<p>" + СтрШаблон(
			"<U><B><A href=v8doc:%1>%2</A><BR></B></U>",
			"DownloadContainer",
			СтрШаблон(НСтр("ru = 'Скачать %1 из 1С:Архива'"),
				?(ЭтоЭлектронныйДокумент, НСтр("ru = 'контейнер'"), НСтр("ru = 'файлы'"))));
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td></tr>";	
	Если Не Форма.НеПоказыватьДанныеОбработки Тогда
		ДобавитьОбзорРезультатов(HTMLТекст, Объект);
	КонецЕсли;
	HTMLТекст = HTMLТекст + "</table>";
	
	HTMLТекст = HTMLТекст + "</body></html>";
	
	ОбзорОбъектовКлиентСервер.УдалитьВредоносныйКодИзТекста(HTMLТекст);
	
	Возврат HTMLТекст;

КонецФункции
//--Кузнецов
#КонецОбласти