//++Кузнецов  для нашего реквизита проект
&НаСервере
&После("ПриСозданииНаСервере")
Процедура аск_сод_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//++Кузнецов добавлчем проект в ТЧ программы
	АСК_ДобавлениеРеквизитов();
	Элементы.Проект.Видимость = Ложь;
	СкрытьКомандуПечати();
КонецПроцедуры 

&НаСервере
Процедура АСК_ДобавлениеРеквизитов()
	
	//ТЧ программа
	ТаблицаПрограммы = ЭтаФорма.Элементы.Программа;  
	ЭлементПроектПрограмма = ЭтаФорма.Элементы.Вставить(
	"аск_сод_ПроектПрограмма",                         // Имя нового элемента
	Тип("ПолеФормы"),                          // Тип элемента
	ТаблицаПрограммы,                          // Родитель — сама таблица ТЧ
	ЭтаФорма.Элементы.ПрограммаГруппаВремяНовое  // Вставить перед этой колонкой
	);
	ЭлементПроектПрограмма.Вид         = ВидПоляФормы.ПолеВвода;
	ЭлементПроектПрограмма.ПутьКДанным = "Объект.Программа.Проект";  // Путь через имя ТЧ
	ЭлементПроектПрограмма.Заголовок   = "Проект";
	
	
	//ТЧ Протокол    
	ТаблицаПротокол = ЭтаФорма.Элементы.Протокол;  
	ЭлементПроектПротокол = ЭтаФорма.Элементы.Вставить(
	"аск_сод_ПроектПротокол",                         // Имя нового элемента
	Тип("ПолеФормы"),                          // Тип элемента
	ТаблицаПротокол,                          // Родитель — сама таблица ТЧ
	ЭтаФорма.Элементы.ПротоколРешили  // Вставить перед этой колонкой
	);
	ЭлементПроектПротокол.Вид         = ВидПоляФормы.ПолеВвода;
	ЭлементПроектПротокол.ПутьКДанным = "Объект.Протокол.Проект";  // Путь через имя ТЧ
	ЭлементПроектПротокол.Заголовок   = "Проект";

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПрограммаПередНачаломИзмененияЗавершение")
Процедура аск_сод_ПрограммаПередНачаломИзмененияЗавершение(Результат, ДополнительныеПараметры)

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;

	ДанныеПункта = ДополнительныеПараметры.ДанныеПункта;
	ЗаполнитьЗначенияСвойств(ДанныеПункта, Результат);

	ЗаполнитьСтрокуПрограммы(ДанныеПункта, ПараметрыПреобразованияМестногоВремени);
	ДанныеПункта.Решение =
	УправлениеМероприятиямиКлиентСервер.ПолучитьРешениеВСтрокеПрограммы(
	ДанныеПункта,
	Объект.Протокол);
	
	#Вставка 
	//++Кузнецов
	ДанныеПункта.Проект = Результат.проект;
	#КонецВставки 
	
	Модифицированность = Истина;

	УправлениеМероприятиямиКлиентСервер.ПересчитатьНачалоОкончаниеПунктовПрограммы(Объект, ПараметрыПреобразованияМестногоВремени);
	ВывестиСуммарнуюДлительностьПрограммы();

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьФормуИзмененияПунктаПрограммы")
Процедура аск_сод_ОткрытьФормуИзмененияПунктаПрограммы(ДанныеПункта)

	Если ДанныеПункта = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = УправлениеМероприятиямиКлиентСервер.НовыйПараметрыФормыВводПунктаПрограммы();

	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДанныеПункта);
	ПараметрыФормы.ВидМероприятия = Объект.ВидМероприятия;
	ПараметрыФормы.СостояниеПрограммы = СостояниеПрограммы;
	
	#Вставка 
	//++Кузнецов
	ПараметрыФормы.Вставить("Проект",ДанныеПункта.Проект);
	#КонецВставки 
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеПункта", ДанныеПункта);
	ОткрытьФорму("Справочник.Мероприятия.Форма.ВводПунктаПрограммы",
	ПараметрыФормы,
	ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ПрограммаПередНачаломИзмененияЗавершение",
	ЭтотОбъект,
	ПараметрыОбработчика));

КонецПроцедуры
//--Кузнецов  для нашего реквизита проект

&НаСервере
Процедура СкрытьКомандуПечати()
    
    ИменаПодгрупп = Новый Массив;
    ИменаПодгрупп.Добавить("ПодменюПечатьВажное");
    ИменаПодгрупп.Добавить("ПодменюПечатьОбычное");
    ИменаПодгрупп.Добавить("ПодменюПечатьСмТакже");
    
    Для Каждого ИмяГруппы Из ИменаПодгрупп Цикл
        Группа = Элементы.Найти(ИмяГруппы);
        Если Группа = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        
        Для Каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
            // Получаем команду, к которой привязана эта кнопка:
            КомандаФормы = Команды.Найти(Кнопка.ИмяКоманды);
            
            Если КомандаФормы <> Неопределено И СтрНайти(КомандаФормы.Заголовок, "Сводная повестка дня") > 0 Тогда
                Кнопка.Видимость = Ложь;
            КонецЕсли;
        КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры